{
    "basic_info": {
      "description_header": "Thank You For Stopping By!",
      "description": "👋 Hello I'm Erik Dodd and welcome to my Portfolio Page! I'm a Software Developer with over 5 years of experience in Sales, Marketing, and Customer Service. I'm passionate about Technology and building websites and applications that users find aesthetically pleasing and interactive. I'm pursuing a career in Software Development because I enjoy problem-solving, and learning new skills, and using technology for social good. I have experience working in businesses of all sizes including start-ups, enterprise-level Tech Companies, small businesses, and even in the non-profit sector. I'm a strong individual performer with a history of consistently high KPI performance. I value the importance of teamwork and building quality relationships with my colleagues and clients.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Memory Game",
        "startDate": "SEPTEMBER 2022",
        "description": "The Problem Domain is that Memory decreases with lack of use, people enjoy fun games, and want to be successfully at these games. So we designed a Memory Game that allows users to select tiles clicking on them to find hidden pairs. When pairs are matched, they are eliminated from the board. User sees current high score, current score, and number of attempts on the screen. High score is stored locally for comparison. We also wanted to give the game an old school vibe, since we love Nintendo and other 80s/90s video games. The application was built using vanilla Javascript, CSS, HTML, and Local Storage.",
        "images": [
          "images/portfolio/memory-game/p1.jpg",
          "images/portfolio/memory-game/p2.jpg"
        ],
        "url": "https://ianmcshoe.github.io/Memory-Game/",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS 3"
          },
          {
            "class": "devicon-html5-plain",
            "name": "HTML 5"
          }
        ]
      },
      {
        "title": "VenU",
        "startDate": "OCTOBER 2022",
        "description": "The Problem Domain is that people don't always know where to find live music and entertainment events in their city or anywhere in the US. People also don't always know where to find venue information or artist tour information. So we developed a web application that helps users search for venues and tour information from artists. This is a Full Stack Application (MERN) that allows userse to search by venue, by artist, and do a bit more",
        "images": [
          "images/portfolio/venU/v1.jpg",
          "images/portfolio/venU/v2.jpg",
          "images/portfolio/venU/v3.jpg",
          "images/portfolio/venU/v4.jpg"
        ],
        "url": "https://venu301.netlify.app/",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-express-original",
            "name": "Express"
          },
          {
            "class": "devicon-nodejs-plain",
            "name": "NodeJs"
          },
          {
            "class": "devicon-mongodb-plain",
            "name": "MongoDB"
          }
          
        ]
      },
      {
        "title": "DEV_BFF",
        "startDate": "JANUARY 2023",
        "description": "The Problem Domain is that Software Developers/Engineers spend lots of time researching and reading long/highly technical articles and documents. This can take quite a bit of time and energy and often requires looking at multiple websites or articles. We wanted to develop a tool that would help Developers/Engineers save time and help them better simplify and understand new topics. So we built a backend CLI application that allows users to ask a coding related question and get a fast, easy to understand response. This application connects to the GPT3 AI and uses a combination of web scraping, automation, and regex to scrape the top result from the search engine and then translate it into an 3-5 paragraphs that are easy to understand. The application also allows you to get another article and comes with a cool accessibility feature that reads the text for you. This application was built using Python, PyCharm, GPT3, Beautiful Soup, Regex, and Pytest.",
        "images": [
          "images/portfolio/dev-bff/devbff.jpg",
          "images/portfolio/dev-bff/devbff2.jpg",
          "images/portfolio/dev-bff/devbff3.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-python-plain",
            "name": "Python"
          }
        ]
      },
      {
        "title": "Mishnar Portfolio",
        "startDate": "MARCH 2023",
        "description": "Built a website for my girlfriend's business to showcase her styling, creative direction and art direction. Designed to be elegant and clean with main emphasis on the visual content. The website has some nice style elements like highlighting the image when you hover over it, increase the image's size when you hover over, a modal, and some other fun stylistic elements. ",
        "images": [
          "images/portfolio/mishnar/mishnar1.jpg",
          "images/portfolio/mishnar/mishnar2.jpg",
          "images/portfolio/mishnar/mishnar3.jpg"
        ],
        "url": "TBD..",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS 3"
          },
          {
            "class": "devicon-html5-plain",
            "name": "HTML 5"
          }
        ]
      }
    ],
    
    "experience": [
      {
        "company": "Avvo",
        "title": "Account Executive",
        "years": "11.2019 - 08.2020",
        "mainTech": [
          ""
        ],
        "technologies": [
          ""
        ]
      },
      {
        "company": "Renova Exterior Detailing",
        "title": "Director of Marketing",
        "years": "07.2017 - 07.2018",
        "mainTech": [
          ""
        ],
        "technologies": [
          ""
        ]
      },
      {
        "company": "TCS World Travel",
        "title": "Guest Services Manager",
        "years": "02.2013 - 07.2015",
        "mainTech": [
          ""
        ],
        "technologies": [
          ""
          
        ]
      }
    ]
  }
